In [6]:
import pandas as pd

In [7]:
dict = {
    "country": ["Brazil", "Russia", "India", "China", "South Africa"],
    "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
    "area": [8.516, 17.10, 3.286, 9.597, 1.221],
    "population": [200.4, 143.5, 1252, 1357, 52.98]
}

In [23]:
brics = pd.DataFrame(dict)
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [24]:
brics.index = ["BR", "RU", "IN", "CH", "SA"]
brics

         country    capital    area  population
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Dehli   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

In [26]:
df= pd.read_csv("car-data.csv")
df

   speed  car_age  experience  risk
0    200       15         5.0    85
1     90       17        13.0    20
2    165       12         4.0    93
3    110       20         NaN    60
4    140        5         3.0    82
5    115        2         8.0    10

In [27]:
df.head(2)

   speed  car_age  experience  risk
0    200       15         5.0    85
1     90       17        13.0    20

In [50]:
df['speed']

0    200
1     90
2    165
3    110
4    140
5    115
Name: speed, dtype: int64

In [49]:
df[1:4]

   speed  car_age  experience  risk
1     90       17        13.0    20
2    165       12         4.0    93
3    110       20         NaN    60

In [57]:
df.iloc[3]

speed         110.0
car_age        20.0
experience      NaN
risk           60.0
Name: 3, dtype: float64

In [58]:
df.loc[[3,5]]

   speed  car_age  experience  risk
3    110       20         NaN    60
5    115        2         8.0    10

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   speed       6 non-null      int64
 1   car_age     6 non-null      int64
 2   experience  5 non-null      float64
 3   risk        6 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 320.0 bytes

In [62]:
df.dropna()

   speed  car_age  experience  risk
0    200       15         5.0    85
1     90       17        13.0    20
2    165       12         4.0    93
4    140        5         3.0    82
5    115        2         8.0    10

In [63]:
df.shape

(6, 4)